{
  "BYAUDIENCE": {
    "ui_VisitorType": [ "If the visitor type is", "Leads or Prospects are visitors, where the visiting IP is tagged to an email id but their purchase status is null. Email gets tagged either during a web engagement or from a mail campaign. Assigning this rule will display your content to leads only." ],
    "ui_VisitorBelongs": [ "If the visitor belongs to or does not belong to a group", "This works on prospect or customer groups who belongs or does not belong to a specific customer segment. Customer segmentation can be done within Plumb5 or can import existing segmentation data. Assigning this rule will display or not display your content to visitors, belonging to the specified segment only." ]
  },
  "BYBEHAVIOUR": {
    "ui_VisitorBehavioural": [ "If the visitor's behavioral score is", "This one is for the agile marketers. If you have enabled scoring for every parameter like frequency, recency, time spent, page depth, or actions, you can display content based on aggregated scores. Assigning this rule will display your content to visitors, belonging to a particular score range." ],
    "ui_VisitorSession": [ "If the visitor's session is or is not", "Display messages for every new session. Trigger messages based on visitor session count. For eg Show a custom message when he is back on your website, maybe the third time. Assigning this rule will display your content to visitors, with a particular session count." ],
    "ui_VisitorPageDepth": [ "If the visitor's page depth is or is not", "Engage your visitor based on the depth of a session. For eg: If the visitor's current session has extended to the third page, display a custom message. If it extends to the fifth page, present a different message. Input your depth level and get started. Assigning this rule will display your content to visitors, with a particular page depth of a session." ],
    "ui_VisitorPageView": [ "If visitor's page view is or is not", "Engage your visitor based on the number of pages viewed. If you have a visitor, who has already browsed more than 8-10 pages, it's time to engage. Just input your page count to trigger your message. Assigning this rule will display your content to visitors, with a particular page count." ],
    "ui_VisitorFrequency": [ "If the visitor's frequency is or is not", "Display messages in context based on the frequency of the visitor. If you have frequent visitors, it's time to engage them and move them to the goal path. Assigning this rule will display your content to visitors, based on frequency count." ],
    "ui_VisitorParticularPage": [ "If the visitor is on a particular page", "Assigning this rule will display your content to visitors when they visit the page that you specify." ],
    "ui_VisitorsVisitedPagesWithPageUrlParameter": [ "If the visitor visited the page with URL parameter", "If the visitor has visited pages with Page URL parameter equal to." ],
    "ui_VisitorSource": [ "If the visitor's source is", "Display personalized messages or offers for visitors coming from various channels. You can show a relevant banner to a person coming from a particular source. For eg: If your visitor clicked on your FB campaign and visited your website, you can quickly display relevant tactical messages. Assigning this rule will display your content to visitors, based on the source URL specified by you." ],
    "ui_VisitorMailRespondent": [ "If the visitor is or is not mail respondent", "Show relevant messages if the visitor is coming to your website from a mail campaign and move them to the desired goal path. This rule can be enabled for emails sent from the Plumb5 EMail platform. Assigning this rule will display your content to visitors, who visits from your mail campaign." ],
    "ui_VisitorSmsRespondent": [ "If the visitor is or is not SMS respondent", "Show relevant messages if the visitor is coming to your website from an SMS campaign and move them to the desired goal path. This rule can be enabled for SMSs sent from the Plumb5 SMS platform. Assigning this rule will display your content to visitors, who visits from your SMS campaign." ],
    "ui_VisitorSearchKeyword": [ "If the visitor's search keyword is", "Show custom messages to your visitor based on their search keyword. For eg: If the visitor comes to your website from Google Search, you can customize your content or banner, based on the search term, used in Google. Assigning this rule will display your content to visitors when their search keyword tag matches the tag, specified by you" ],
    "ui_VisitorCountry": [ "If the visitor's country is or is not", "Assigning this rule will display your content to visitors when they visit the page from a specific country." ],
    "ui_VisitorCity": [ "If the visitor's City is or is not", "Assigning this rule will display your content to visitors when they visit the page from a specific City." ],
    "ui_VisitorAlreadyVisitedPages": [ "If the visitor is already visited pages", "Assigning this rule will display your content to visitors who have visited your specified page(s) either session-wise or overall." ],
    "ui_VisitorsAlreadyVisitedPagesWithPageUrlParameter": [ "If the visitor is already visited pages", "Assigning this rule will display your content to visitors who have visited your specified page(s) with URL parameters." ],
    "ui_VisitorNotAlreadyVisitedPages": [ "If the visitor is not already visited pages", "Assigning this rule will display your content to visitors who have NOT visited your specified page(s) either session-wise or overall." ],
    "ui_VisitorsNotAlreadyVisitedPagesWithPageUrlParameter": [ "If the visitor is not already visited pages with URL parameter", "If the visitor has already not visited pages with Page URL parameter equal to." ],

    "ui_VisitorOverallSpent": [ "If the visitor's overall time spent in site", "Assigning this rule will display your content to visitors who have spent the specified time in seconds on your site." ],
    "ui_VisitorBrowser": [ "If the visitor's browser is mobile or desktop", "Assigning this rule will display your content to visitors who have visited your site over Mobile or Desktop." ]
  },
  "BYINTERACTION": {
    "ui_VisitorClickedSpecific": [ "If the visitor has clicked a specific button", "Show contextual messages or offers based on click events. You should enable event-tracking on your Plumb5 tracking scripts to be able to sync event data with the interactions. Assigning this rule will display your content to visitors, who have clicked a specific button" ],
    "ui_VisitorNotClickedSpecific": [ "If the visitor has not clicked a specific button", "Show contextual messages or offers based on click events. You should enable event-tracking on your Plumb5 tracking scripts to be able to sync event data with the interactions. Assigning this rule will display your content to visitors, who have NOT clicked a specific button" ],
    "ui_VisitorRespondedChat": [ "If the visitor responded with chat agent", "Trigger relevant messages based on past chat responses. Login to your Plumb5 account and create groups of your chat respondents. Assign the group to the interaction. Assigning this rule will display your content to visitors, who already have a chat history" ],
    "ui_VisitorResponseMail": [ "If the visitor's response to your mail campaigns is", "You can display custom messages for highly responsive mail recipients. This works in sync with the Plumb5 Email platform to access the mail response segments. Assigning this rule will display your content to visitors, who belong to the specified response segment." ],
    "ui_VisitorResponseForm": [ "If the visitor responded to a particular form", "You can display custom messages for Form respondent. Assigning this rule will display your content to visitors, who have previously engaged with the specified Form." ],
    "ui_VisitorNotResponseForm": [ "If the visitor has not responded to a particular form", "You can display custom messages for Form respondent. Assigning this rule will display your content to visitors, who have NOT previously engaged with the specified Form." ],
    "ui_VisitorResponseFormAnswer": [ "If the visitor responded to a form with an answer", "You can display custom messages for Form respondent. Assigning this rule will display your content to visitors, who have previously Answered questions in the specified Form." ],
    "ui_VisitorClosedForm": [ "If the visitor closed the form for Nth time, then don't show", "Assigning this rule will NOT display your content to visitors who have closed the form for a specified number of times." ],
    "ui_VisitorAddedCart": [ "If the visitor added these products to the cart", "Display targeted messages or offers based on 'Add to cart' events. You should enable event-tracking on your Plumb5 tracking scripts, to be able to sync event data with the interactions. Assigning this rule will display your content to visitors, who have added the specified products to the cart." ],
    "ui_VisitorAddedCategoryCart": [ "If the visitor added these products categories to the cart", "Display targeted messages or offers based on 'Add to cart' events. You should enable event-tracking on your Plumb5 tracking scripts, to be able to sync event data with the interactions. Assigning this rule will display your content to visitors, who have added the specified product categories to the cart." ],
    "ui_VisitorNotAddedCategoryCart": [ "If the visitor not added these products categories to the cart", "Display targeted messages or offers based on 'Add to cart' events. You should enable event-tracking on your Plumb5 tracking scripts, to be able to sync event data with the interactions. Assigning this rule will display your content to visitors, who have NOT added the specified product categories to the cart." ],
    "ui_VisitorAddedSubCategoryCart": [ "If the visitor added these products subcategories to the cart", "Display targeted messages or offers based on 'Add to cart' events. You should enable event-tracking on your Plumb5 tracking scripts, to be able to sync event data with the interactions. Assigning this rule will display your content to visitors, who have added the specified product sub-categories to the cart." ],
    "ui_VisitorNotAddedSubCategoryCart": [ "If the visitor not added these products subcategories to the cart", "Display targeted messages or offers based on 'Add to cart' events. You should enable event-tracking on your Plumb5 tracking scripts, to be able to sync event data with the interactions. Assigning this rule will display your content to visitors, who have NOT added the specified product sub-categories to the cart." ],
    "ui_VisitorViewedCart": [ "If the visitor viewed but did not add these products to the cart", "Show custom messages or offers based on page views of the specified products. Assigning this rule will display your content to visitors, who have viewed the specified products but have not added to cart yet." ],
    "ui_VisitorDroppedCart": [ "If the visitor dropped a product from the cart", "Display personalized messages or offers based on drop-out tags of a visitor. Integrate your store data with Plumb5, to be able to sync transaction data. Assigning this rule will display your content to visitors, who have added the specified products to the cart but has not purchased it yet." ],
    "ui_CustomerPurchasedProducts": [ "If the customer purchased any of these products", "Show related accessories or offers based on past purchases of your browsing customer. Integrate your store data with Plumb5 or upload purchase segmentation data. Assigning this rule will display your content to visitors, who have purchased the specified products." ],
    "ui_CustomerNotPurchasedProducts": [ "If the customer has not purchased any of these products", "Show related accessories or offers based on past purchases of your browsing customer. Integrate your store data with Plumb5 or upload purchase segmentation data. Assigning this rule will display your content to visitors, who have NOT purchased the specified products." ],
    "ui_CustomerTransaction": [ "If the customer's total transaction", "Display personalized messages or offers based on purchase points of your browsing customer. Integrate your store data with Plumb5 and create customer groups based on total purchases. Assigning this rule will display your content to customers, where the total purchase count matches the range, specified by you." ],
    "ui_CustomerCurrentValue": [ "If the customer's current value is", "Display personalized messages or offers based on current value status of your browsing customer. The current value status is calculated by integrating transaction data and spend data. Spend data needs to be imported into your Plumb5 account. Assigning this rule will display your content to visitors, where the total value count matches the range, specified by you." ],
    "ui_CustomerDurationLastPurchase": [ "Customer duration since last purchase", "Assigning this rule will display your content to visitors, where the visitor has not purchased any product for the specified time in days." ]
  },
  "BYEVENT": {
    "ui_VisitorFormImpression": [ "If the visitor's form impression", "Assigning this rule will display your content to visitors, where the visitor has seen all the forms or the specified form by the number of times specified." ],
    "ui_VisitorFormClose": [ "If the visitor form close", "Assigning this rule will display your content to visitors, where the visitor has closed all the forms or the specified form by the number of times specified." ],
    "ui_VisitorFormResponse": [ "If the visitor's total form response", "Assigning this rule will display your content to visitors, where the visitor has responded to all the forms or the specified form by the number of times specified." ],
    "ui_FormNthTime": [ "Show this form only Nth Time", "Assigning this rule will display your content to visitors, where the visitor will see the form only for the number of times specified." ]
  },
  "BYPROFILE": {
    "ui_CustomerProspectSocial": [ "If the customer's/prospect's social status is", "Display personalized messages based on the social activity of the prospect or the customer. For eg: Show a custom message if the visitors frequent your site from Facebook. Assigning this rule will display your content to visitors, where the social status tag matches the tag specified by you." ],
    "ui_CustomerProspectInfluential": [ "If the customer's/prospect's influential score is", "Display custom messages based on visitor's social influential score. Assigning this rule will display your content to visitors, where the influential score satisfies the score range, specified by you" ],
    "ui_CustomerProspectRating": [ "If the customer's/prospect's product rating is", "Display targeted messages based on customer's rating for the product. Assigning this rule will display your content to visitors, where the rating response score matches the score range, specified by you" ],
    "ui_ProspectNurture": [ "If the prospect's nurture status is", "Display targeted messages or offers to your prospects, based on their status. Assigning this rule will display your content to visitors, who are prospects and satisfy the specified status tag" ],
    "ui_CustomerProspectGender": [ "If the customer's/prospect's gender is", "Display personalized messages based on gender. Assigning this rule will display your content to visitors, where the user's profile tags match the tag, specified by you" ],
    "ui_CustomerProspectMarital": [ "If the customer's/prospect's marital status is", "Display personalized messages based on their marital status. Assigning this rule will display your content to visitors, where the user's profile tags match the tag, specified by you." ],
    "ui_CustomerProspectProfession": [ "If the customer's/prospect's a profession/industry is", "If you are a B2B marketer, you could display your interactions based on the visitor's professional information. Assigning this rule will display your content to visitors, where the user's professional tags match the tag, specified by you." ],
    "ui_VisitorConnectedSocial": [ "If the visitor is connected socially", "Display your messages to visitors who are still not connected on your social pages. Assigning this rule will display your content to visitors, where the email id is not tagged with any social profiles." ],
    "ui_CustomerLoyalty": [ "If the customer's/prospect's loyalty points are", "Display your form based on loyalty points. Set a number range so that you can display it to customers or prospects within a specific score range. Assigning this rule will display your content to visitors, whose score matches the score range specified by you." ],
    "ui_CustomerRFMS": [ "If the customer's RFMS score is", "Display your form based on RFMS score on Plumb5 (needs to be configured) or you could import your score list and assign a score range in the form. Show key messages to visitors with a low score as they could be your drifting prospects or customers. You can even set it for the RFS score of your prospect which helps in engaging a drifting prospect. Assigning this rule will display your content to visitors, whose score matches the score range specified by you. Works for prospects and customers only." ],
    "ui_CustomerDOB": [ "If the visitor's DOB is", "Assigning this rule will display your content to visitors, where the date matches the visitor's Birthday." ]
  }
}
